package uz.fayz.response;

public interface Krill {

    String helloKrill = "Ассалому алайкум, <b>Ўзбекистон Республикаси Президенти ҳузуридаги " +
            "Давлат хизматини ривожлантириш агентлигининг</b> мурожаатлар тизимига <b>хуш келибсиз!</b>\n\n" +
            "Сизга давлат фуқаролик хизмати соҳасидаги янгиликлардан бохабар бўлиб бориш учун мурожаат " +
            "йўллашдан аввал t.me/argos_uz каналига аъзо бўлишни тавсия этамиз.\n";

    String whatIsYourNameKrill = "<b>Илтимос, исм, фамилиянгизни ва отангизни исмини киритинг!</b>\n" +
            "(Масалан: Жумаев Ғиёс Акбарович)\n";

    String whenIsYourBirthDateKrill = "<b>Туғилган санангиз (сана/ой/йил)</b>";

    String whereIsYourProvinceKrill = "<b>Қайси вилоятдансиз?</b>\n" +
                                        "(\uD83D\uDC47Қуйидаги рўйхатдан вилоятингизни танланг)";

    String whereAreYouWorkKrill = "<b>Иш  жойингиз?</b>\n";

    String whatIsYourPositionKrill = "<b>Лавозимингиз?</b>";

    String typeOfPropositionKrill = "<b>Мурожаатингиз қайси йўналишда?</b>\n" +
            "\uD83D\uDC47Қуйидаги рўйхатдан мосини танланг";

    String checkTypeOfPropositionKrill = "Таклиф \uD83D\uDE4B\uD83C\uDFFB\u200D♂️Муаммо \uD83E\uDD26\uD83C\uDFFB\u200D♂️" +
            "Ариза \uD83D\uDC81\uD83C\uDFFB\u200D♂️";

    String enterYourPropositionKrill = "<b>Мурожаат матнини киритинг \uD83E\uDD17:</b>\n" +
            "(<b>Илтимос, мурожаатингизни киритишда:</b> ариза, шикоят ёки таклифингизни тўлиқроқ кўрсатишга ҳаракат қилинг.)";

    String sendYourFilesKrill = "Ҳурматли фойдаланувчи сиз мазкур бот орқали мурожаатингизга оид файлларни ҳам " +
            "юборишингиз мумкин. Агарда, сизда тегишли файллар мавжуд бўлмаса давом этиш тугмасини босинг";

    String pressShareContactButtonKrill = "Илтимос, мурожаатингизни кўриб чиқишимиз учун телефон\n" +
            "рақамингизни қолдиришингиз керак:\n" +
            "(Бунинг учун, қуйидаги <b>\"Телефон рақамини юбориш \uD83D\uDCF1\" </b>" +
            "тугмасини босинг \uD83D\uDC47\uD83C\uDFFB)";

    String lastKrill = "<b>Табриклаймиз, Мурожаатингиз муваффақиятли қабул қилинди</b>, тез орада Сизга жавоб берамиз.\n" +
            "<b>Унутманг, Сизнинг мурожаатингиз биз учун муҳим!</b>\n\n" +
            "Қайта мурожаат юбориш учун /start буйруғини юборинг\n\n" +
            "Телеграмдаги Каналимиз (https://t.me/argos_uz)га обуна бўлишни унутманг!\n\n" +
            "\uD83D\uDC49Веб саҳифа: \t\t    https://argos.uz/\n\n" +
            "\uD83D\uDC49Фейсбукдаги саҳифамиз:     https://www.facebook.com/argos.pressa\n\n" +
            "\uD83D\uDC49Инстаграмдаги саҳифамиз:   https://www.instagram.com/argos_uzbekistan/\n\n" +
            "\uD83D\uDC49 vacancy.argos.uz\n";

}
